In [1]:
x=[1,2,3,4,5]
x.sort() # sort is method it is dependented of object , whereas function is independented. 
sorted(x)

[1, 2, 3, 4, 5]

In [2]:
sorted(x)

[1, 2, 3, 4, 5]

**class in python**

In [18]:
class Person:
    #constructor overloading of constructors or overridding  are not defined 
    def __init__(self,n='Riya',a=19):
        self.name=n
        self.age=a
    def show(self):
        print('values are: ')
        print(self.name ,self.age)

In [10]:
#data centric approach , data processing approach  to create an object
obj1=Person('Riya',19)

In [11]:
obj1.age

19

In [12]:
obj1.name

'Riya'

In [8]:
obj1.show()

values are:
Riya 19

#default arguments and keyword arguments

In [19]:
obj2=Person()
obj2.show()

values are:
Riya 19

#** More data structured :- array ** # yesterday we saw list, tuple, set, dict

#linear algrebra , linear regression |

numpy package

In [23]:
import numpy as np

In [24]:
num=np.array([56,33,15,38,61,49,20])

In [25]:
print(num)

[56 33 15 38 61 49 20]

In [27]:
print(type(num))

<class 'numpy.ndarray'>

In [31]:
num.dtype

dtype('int32')

In [32]:
# 4 byte means  32 bit

In [34]:
n=2** 32
n #maximum number sorted in interger

4294967296

In [36]:
n=2**200
n

1606938044258990275541962092341162602522202993782792835301376

In [38]:
n= 34 ** 1234
n

699815617362686870163997571635872715284083435199329774173709361749998931729558790221557892286797269408707614145452668916937318612955984937209583026047425997105818855944152373513569732924544248879786444015916362058812676498428359467678908630683525674553295952275027572760901662748546606445431228934896353792603496987216071988094579698770983876119901714505254679856106832565463503542843338460680833724450466227522787728637020177943000296909043962898673078361813230437929715784464873812184478643820443238328611510473688015781470093348070309718181156000273477222321310767600371429094774180382810446848640613857481342224897084242521977476101541132959355778464979806284395511830819982101316312171273250729252031049077985722129544252732592735970451225437852788543474358624221597877669190348660175301296589317510961677303572444941202713378629670088372468196171689997265637400969676268476669610306127212166304054764889121779672513084502156029707187125510858213156376620288040309524875133352781916443317923407978298135919241200359570220322502755042901724220588087040912532101981280805712954347121695968693516149060115482162076162875504206308428429155967692913386595597100490733291417221934759620246634793023303875848295306847431256671597656962097621524616771721300236109352198083936107536756860280387408079725351375820540403574299692515799464311948301892536410377000788367748782290680670513761862862704838830521781907014590114330108928103291596831000339881185667164687779406935659580632876843002368881517925521583454726891639264567229024177364359799257794324964822900459691351870684830091644160379735873598846178796258700127482190631247901724054083647600501324513346588667498734580880983048033266372805349028386992199309867735923204930489481458953994299448902702802568513494992918778532458550613517371086045605406516158333197078108347990803243601126354014597287448879100146888409204979951129157697536

In [41]:
num1=np.array([56,67.8])
num1

array([56. , 67.8])

In [43]:
num1.dtype

dtype('float64')

In [50]:
num2=np.array([56,678,"Riya",11,45])
num2
num2.dtype

dtype('<U11')

In [ ]:
#u is for unicode with 11 bits

In [51]:
num3=np.array([True,False,True])
num3.dtype

dtype('bool')

In [52]:
z=np.zeros(5)
z

array([0., 0., 0., 0., 0.])

In [54]:
o=np.ones(5)
o

array([1., 1., 1., 1., 1.])

In [55]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [56]:
np.arange(4,9)

array([4, 5, 6, 7, 8])

In [57]:
np.arange(2,20,2)

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18])

In [58]:
np.arange(10,0,-1)

array([10,  9,  8,  7,  6,  5,  4,  3,  2,  1])

In [60]:
np.arange(-5,5,0.25)
# this utilities are used in linear algebra
# arrange allows float increment also whereas range doesnot allows the same

array([-5.  , -4.75, -4.5 , -4.25, -4.  , -3.75, -3.5 , -3.25, -3.  ,
       -2.75, -2.5 , -2.25, -2.  , -1.75, -1.5 , -1.25, -1.  , -0.75,
       -0.5 , -0.25,  0.  ,  0.25,  0.5 ,  0.75,  1.  ,  1.25,  1.5 ,
        1.75,  2.  ,  2.25,  2.5 ,  2.75,  3.  ,  3.25,  3.5 ,  3.75,
        4.  ,  4.25,  4.5 ,  4.75])

In [64]:
np.linspace(1,10,10) #it is linearly space between 2 elements and they are in the range given

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [72]:
num1=np.array([56,33,15,36])
num2=[56,33,15,36]
print(type(num2))

<class 'list'>

In [73]:
num1 *2

array([112,  66,  30,  72])

In [74]:
num2 *2

[56, 33, 15, 36, 56, 33, 15, 36]

In [75]:
num1 ,num2

(array([56, 33, 15, 36]), [56, 33, 15, 36])

In [76]:
num1 + 10

array([66, 43, 25, 46])

In [77]:
num1-10

array([46, 23,  5, 26])

In [78]:
num1=np.array([50,33,45,6,7,88,90])
num2=np.array([50,33,45,6,7,88,90])

In [79]:
num1+num2

array([100,  66,  90,  12,  14, 176, 180])

In [80]:
num1-num2

array([0, 0, 0, 0, 0, 0, 0])

In [81]:
num1>num2

array([False, False, False, False, False, False, False])

In [86]:
# scalar and vector collection of scalar is vector
#single element isa scalar multiple elements is a vector
num1==num2

array([ True,  True,  True,  True,  True,  True,  True])

In [84]:
True+True

2

In [85]:
sum(num1==num2) # sum a pre-built function

7

In [87]:
#mutiple vectors of equal length are matrix
mat1=np.array([[4,5,6],[2,9,8]])
mat1

array([[4, 5, 6],
       [2, 9, 8]])

In [88]:
mat1.shape

(2, 3)

In [89]:
mat1 *2

array([[ 8, 10, 12],
       [ 4, 18, 16]])

In [90]:
mat1.reshape(3,2)

array([[4, 5],
       [6, 2],
       [9, 8]])

In [91]:
mat1.reshape(6,1)

array([[4],
       [5],
       [6],
       [2],
       [9],
       [8]])

In [95]:
mat1.reshape(6)

array([4, 5, 6, 2, 9, 8])

In [97]:
mat1.flatten()

array([4, 5, 6, 2, 9, 8])

In [98]:
num1

array([50, 33, 45,  6,  7, 88, 90])

In [100]:
num1=np.array([50, 33, 45,  6,  7, 88, 90,21])

In [101]:
num1.reshape(4,2)

array([[50, 33],
       [45,  6],
       [ 7, 88],
       [90, 21]])

In [102]:
num.sum()

272

In [103]:
num.max()

61

In [104]:
num.min()

15

In [105]:
num.mean()

38.857142857142854

In [107]:
np.median(num)

38.0

In [108]:
num.size

7

In [109]:
list(num)

[56, 33, 15, 38, 61, 49, 20]

In [110]:
tuple(num)

(56, 33, 15, 38, 61, 49, 20)

In [1]:
set(num)

NameError: name 'num' is not defined

# Pandas :- for analayzing the data , provides high performance data manipulation and analysis

#Series :- 1D labeles homogenous data.
#Datafram:- 2d array with heterogenous data.

In [2]:
import pandas as pd

In [5]:
s=pd.Series([73,51,23,56,78],index=range(100,105))
s

100    73
101    51
102    23
103    56
104    78
dtype: int64

In [6]:
s[102]

23

In [7]:
s[102]=58

In [8]:
s

100    73
101    51
102    58
103    56
104    78
dtype: int64

In [9]:
s.min()

51

In [10]:
s.max()

78

In [11]:
s.sum()

316

In [13]:
s.size

5

In [14]:
s.mean()

63.2

In [15]:
s.median()

58.0

In [17]:
s.mode()

0    51
1    56
2    58
3    73
4    78
dtype: int64

# Data Frame

In [3]:
import pandas as pd
a=pd.Series([1,2,3,4,5])
b=pd.Series(['ajay','radha','prem','rani','vikas'])
c=pd.Series([67.88,85.34,75.67,56.66,64.34])

In [4]:
df= pd.DataFrame({
    'roll':a,
    'name':b,
    'marks':c
})

In [5]:
df #Dataframe is collection of series and it is form in the tabular form

   roll   name  marks
0     1   ajay  67.88
1     2  radha  85.34
2     3   prem  75.67
3     4   rani  56.66
4     5  vikas  64.34

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.dtypes #object is series of mixture of data

roll       int64
name      object
marks    float64
dtype: object

In [9]:
# Data set:- contains lot of separate peieces of data but can be used to train an algorithm with the goal of finding the prede
#predectiable output 
# data set process 
import os
os.getcwd()

'C:\\Users\\Riya Pandey\\Python for data science'

In [11]:
# csv file comma seperated value
df=pd.read_csv('student.csv')

In [12]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [13]:
df1=pd.read_csv('student1.csv')

In [14]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [15]:
headers=['A','B','C','D','E']
df1=pd.read_csv('student1.csv',names=headers)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [16]:
df3=pd.read_csv('student3.tsv')
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [17]:
df3=pd.read_csv('student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.shape

(10, 5)

In [21]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

In [22]:
df.size

50

In [23]:
df.dtypes #this are t

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [24]:
df.T #attributes

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [26]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [27]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [28]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

In [29]:
#####Silcing

In [33]:
x=df.iloc[:9,:4]
x

   roll     name class  marks
0     1     anil    TE  56.77
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75

In [34]:
df.iloc[3:,1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [35]:
df.iloc[5:,:]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [36]:
 df.iloc[[2,5,6,7],1:]

     name class  marks  age
2  aniket    BE  76.88   19
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23

In [37]:
df.iloc[[2,5,6,7],[1,3,4]]

     name  marks  age
2  aniket  76.88   19
5  ayesha  49.55   20
6    amar  65.34   19
7   amita  68.33   23

In [39]:
df.iloc[5,:]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [41]:
df.iloc[:,1] # this is series

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [44]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [47]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [48]:
df.loc[3:8,['name','marks']]

      name  marks
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75

In [49]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [50]:
df.head(1)

   roll  name class  marks  age
0     1  anil    TE  56.77   22

In [51]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [52]:
df.drop([5,2,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [56]:
df.drop('class',axis=1) #axis to understand whether it refers to column  by default axis is 0 which means rows to make it column will use asiz as 1

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [57]:
df['marks'].sum()

644.9899999999999

In [58]:
df['marks'].mean()

64.499

In [59]:
df['marks'].median()

64.31

In [60]:
df['marks'].max()

78.66

In [61]:
df['marks'].min()

49.55

In [64]:
df['marks'].mode()

0    49.55
1    56.75
2    56.77
3    59.77
4    63.28
5    65.34
6    68.33
7    69.66
8    76.88
9    78.66
Name: marks, dtype: float64

In [65]:
df['marks'].count()

10

In [66]:
df['marks'].std()

9.207178901994535

In [67]:
# types of data  qualitative(not used in  mathematical expression) and quantative(value used in mathematical expression)
# under qualatative 2 types norminal(any strings that cannot be compared) (eg:-name)and ordinal(strings that can be compared)(eg:- class)
# under quantative 2 types:- discrete(full numbers without decimal)(eg:-roll) continous(that have decimal value))(eg:-marks,age)

In [68]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [70]:
df['age'].value_counts()

20    4
21    2
19    2
22    1
23    1
Name: age, dtype: int64

In [71]:
df['class'].value_counts()

TE    5
BE    5
Name: class, dtype: int64

In [72]:
df['name'].value_counts()

anil       1
amit       1
aniket     1
ajinkya    1
asha       1
ayesha     1
amar       1
amita      1
amol       1
anmol      1
Name: name, dtype: int64

In [73]:
df.value_counts()

roll  name     class  marks  age
1     anil     TE     56.77  22     1
2     amit     TE     59.77  21     1
3     aniket   BE     76.88  19     1
4     ajinkya  TE     69.66  20     1
5     asha     TE     63.28  20     1
6     ayesha   BE     49.55  20     1
7     amar     BE     65.34  19     1
8     amita    BE     68.33  23     1
9     amol     TE     56.75  20     1
10    anmol    BE     78.66  21     1
dtype: int64

In [74]:
df['age'].values

array([22, 21, 19, 20, 20, 20, 19, 23, 20, 21], dtype=int64)

In [75]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [76]:
list(df['marks'])

[56.77, 59.77, 76.88, 69.66, 63.28, 49.55, 65.34, 68.33, 56.75, 78.66]

##### Summary

In [78]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [79]:
# 50% is for median  the two parts created by median 25% denotes the first half of 75% denoted the median of second half

In [80]:
df['roll'].mean()

5.5

In [81]:
df['roll'].median()

5.5

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes